posts/2015-11-15-latexskim-sync.org
#+date: <2015-11-15>
#+filetags: emacs latex
#+title: LaTeX-Skim Sync

I recently started using John Wiegley's [use-package](https://github.com/jwiegley/use-package ) for my Emacs init files. For Auctex, I used


#+begin_example latex
(use-package tex
    :ensure auctex)
#+end_example

and everything worked except for sync with Skim on OS X. =C-c v= would not launch the Skim, even though I was confident that the Skim was set to be the default viewer. Instead, no viewer would launch, and I'd see "View command: dvi2tty -q -w 132" in the minibuffer.

After seeing that some others had used a slightly different configuration, I changed mine to


#+begin_example latex
(use-package tex-site
    :ensure auctex)
#+end_example


and everything started working fine. I still have no idea why, but it may help someone else.


#+begin_tagline
Tagged: [[file:../tags/emacs.org][Emacs]] [[file:../tags/latex.org][Latex]]
#+end_tagline
