docs/posts/2015-11-15-latexskim-sync.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 08, 2025 05:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LaTeX-Skim Sync</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">LaTeX-Skim Sync</h1>
<p class="subtitle" role="doc-subtitle">Nov 15, 2015 00:00</p>
</header><p>
I recently started using John Wiegley&rsquo;s [use-package](<a href="https://github.com/jwiegley/use-package">https://github.com/jwiegley/use-package</a> ) for my Emacs init files. For Auctex, I used
</p>


<pre class="example" id="org6b4d77c">
(use-package tex
    :ensure auctex)
</pre>

<p>
and everything worked except for sync with Skim on OS X. <code>C-c v</code> would not launch the Skim, even though I was confident that the Skim was set to be the default viewer. Instead, no viewer would launch, and I&rsquo;d see &ldquo;View command: dvi2tty -q -w 132&rdquo; in the minibuffer.
</p>

<p>
After seeing that some others had used a slightly different configuration, I changed mine to
</p>


<pre class="example" id="org5ee3e6a">
(use-package tex-site
    :ensure auctex)
</pre>


<p>
and everything started working fine. I still have no idea why, but it may help someone else.
</p>


<div class="tagline" id="org8698c54">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a> <a href="../tags/LaTeX.html">latex</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 08, 2025 05:11.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
